run/damBreak4phaseLaminar/0/T.oil
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    rightWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    atmosphere
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      uniform 293;
        value           uniform 293;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
